{"work_histories": [{"company": "Kastelo", "position": "QA Tester", "description": "Automating user interactions on mobile devices using Appium and WebdriverIO to test complex user flows.\n\n- Utilized Android Studio and Xcode for device-specific testing.\n- Implemented Playwright for web-based scripting and cross-platform automation.\n- Developed a unified codebase that runs tests for both Android and iOS simultaneously.\n- Integrated AI to assist in deciphering selectors and optimizing test flows.\n- Streamlined repetitive front-end testing tasks, including auto-detection of devices and dynamic configuration management.", "start": "2024-10-01", "end": null, "still_there": true, "skills": [{"name": "Android Studio"}, {"name": "Selenium WebDriver"}, {"name": "Xcode"}, {"name": "iOS"}, {"name": "Appium"}, {"name": "Slack"}, {"name": "Playwright"}, {"name": "Cursor"}, {"name": "OpenAI API"}, {"name": "Anthropic Claude API"}]}, {"company": "Python Programming Solutions", "position": "Python Engineer / CEO / Owner", "description": "Developing a framework for hosting and managing fast, modern web applications.\n\n- Integrated Django CRM as a backbone for content management (text, images, video).\n- Developed a management dashboard for businesses to update content and products.\n- Implemented e-commerce features including login management, product CRUD, and cart processing with Yoco integration.\n- Created an administrative interface for moderation and content oversight.\n\n**Projects:**\n- [3 Pillars Backend](https://3pillars.pythonanywhere.com/)\n- [3 Pillars Management Dashboard](https://3pillars-frontend.vercel.app/)\n- [Java Mellow E-commerce Demo](https://java-mellow-project.vercel.app/)", "start": "2008-05-01", "end": "0001-01-01", "still_there": true, "skills": [{"name": "JavaScript"}, {"name": "HTML"}, {"name": "CSS"}, {"name": "MySQL"}, {"name": "PHP"}, {"name": "Python"}, {"name": "WordPress"}, {"name": "PostgreSQL"}, {"name": "CodeIgniter"}, {"name": "Django"}, {"name": "Bash"}, {"name": "Postman"}, {"name": "CakePHP"}, {"name": "Ubuntu"}, {"name": "GIMP"}]}, {"company": "4-Sure", "position": "Python Backend Developer", "description": "**Pycharm**\n\nFirst time I was forced to intimately grasp Pycharm and loved it. From setting up the virtual environment to running tests against the code-base and database. Still used the command line for Git but ended up creating tests to run against any client instance.\n\n**Fault Finding and bug fixing**\n\nLogging the functionality of a Class, Function or endpoint has become my top priority for one reason: the logged information can be used to create tests for that particular code. That means not only is it easier to create the test i.e. not faked and valid from the frontend, but once the test is using the logged data, you essentially start testing the developers use the correct data and receive valid errors or returned data. This also means when the code is worked on in the master, the tests created from logging can double-check that the functionality is still working.\n\nFinally automation. We can use the tests to automate testing before the code is released live. This starts to ensure that, as a bug stomper, I don't chase bugs introduced by front-end software testers entering in random information and correct data structure is enforced.\n\n**PyTest**\n\nI found out the hard way that testing helps. Before adjusting a single letter of code, write a basic test to hit the endpoint/function and check the returned data. If needed inject test data. Can be tricky if you need to save or test against a database. Use Pycharm to manage the different tests.\n\nCan integrate TOX if the environment allows.\n\n**BUGS**\n\nEvery minor bug came through me. Replicating the error was task one. Which was a test and then fixing it was easier. Trawling error logs to find clues and context was key. \n\nFirst the client, the environment, Development, Staging or LIVE, and a claim number. All major traffic was focused on two main endpoints or Classes. Create and Update. Create being the easier, I created that one from code setup for me. Client aware i.e. used specific code for individual clients stored on the code.\n\nClients included Multichoice, Builders, and the insurance industry.\n\nManaged through Jira (Attlassin) and linked to GitHub.\n\n **Django rest API**\n\nI was tasked with the creation of endpoints and functionality. Usually, I am given a JSON data packet then depending on what's needed either save/update the database, request external API, or code alternative functionality.\n\n**Django Authentication**\n\nIntegrated OTP Authentication into the custom backend.\n\n**GIT**\n\nBranching of development and committing to the development branch for each customer. Never touching master. There were up to 8 clients linked through Atlassian.\n\n**Team**\n\nI've always worked in conjunction with other developers, allowing me to focus on the backend. I understand frontend, I need to, but my talent lies in the backend.\n\nThe only time you see my work is in the Documentation. The rest is endpoints and backend functionality hidden from view. Or when something not working. ", "start": "2019-04-01", "end": "2020-03-01", "still_there": false, "skills": [{"name": "Python"}, {"name": "Django"}, {"name": "Git"}, {"name": "Postman"}, {"name": "PyCharm"}, {"name": "Unit Testing"}, {"name": "pytest"}, {"name": "Ubuntu"}]}, {"company": "Tangent Solutions", "position": "Junior Consultant", "description": "PHP (Laravel)\nIntroduction Docker and Kubernetics. Could build basic images and run images. I see the potential but lack the ambition to dive deeper. \nContracted out to VumaTel for development on their backend. At VumaTel we developed using Django and Ansible to automate deployment.\n", "start": "2018-03-01", "end": "2019-02-01", "still_there": false, "skills": [{"name": "Scrum"}, {"name": "Docker"}, {"name": "Laravel"}, {"name": "Django"}, {"name": "Git"}, {"name": "Kubernetes"}, {"name": "Ansible"}, {"name": "Slack"}, {"name": "PyCharm"}, {"name": "Ubuntu"}]}, {"company": "Bike Bar 58 Lower main Rd", "position": "Manager", "description": "So I walked into this bar and four years later I left. What started out as a Sunday shift ended in me being manager. ", "start": "2015-04-01", "end": "2017-12-01", "still_there": false, "skills": []}, {"company": "MiServe", "position": "Partner IT Specialist / Systems Engineer", "description": "This startup was looking at addressing the internet access or lack thereof, in Observatory, Cape Town.\nWe bought wireless internet and were trying to set up small network nodes to sell the internet to business owners and homeowners. I started setting up the servers and configuring the individual nodes to share the data.\nTo keep it simple we used Squid as a proxy server. But  2g / 3g and larger players in the industry made it hard to get into the market...", "start": "2015-05-01", "end": "2016-05-01", "still_there": false, "skills": [{"name": "Python"}, {"name": "Django"}, {"name": "Nginx"}, {"name": "Apache HTTP Server"}, {"name": "Ubuntu"}]}, {"company": "KrazyBoys", "position": "Python Engineer", "description": "Sole purpose was to help on the development of [This is me](https://thisisme.com/).\r\nWritten in Python using the Django framework.\r\n\r\n**Tools used in the development:** \r\n\r\nSublime Text2\r\nUbuntu Desktop / Server\r\nGit\r\nIntegrating 3rd party API for user validation.\r\nForm creation with JavaScript validation", "start": "2014-11-01", "end": "2015-03-01", "still_there": false, "skills": [{"name": "JavaScript"}, {"name": "Python"}, {"name": "Bootstrap"}, {"name": "Scrum"}, {"name": "Django"}, {"name": "Git"}, {"name": "Slack"}, {"name": "Ubuntu"}]}, {"company": "Bytes Managed Solutions", "position": "UI Designer", "description": "Upgrading Pick 'n Pay's smart shopper kiosk.\r\nTasked with using Internet Explorer and XML to manage a smart shopper Kiosk's products. This instance was smartphones.\r\nUsed a touch screen with gestures to browse and select any given product.\r\nDevice ran Windows XP. ", "start": "2014-06-01", "end": "2014-11-01", "still_there": false, "skills": [{"name": "PHP"}, {"name": "XML"}, {"name": "Windows XP"}]}, {"company": "iono.fm", "position": "PHP Engineer", "description": "My role was to develop on a Mac using VM WARE 6 to run Ubuntu 12.04.\r\nWe used Source Tree to manage a GitHub repository.\r\nIterm and byubo to manage and install the server software and deploy code using bash scripting.\r\nProgram in PHP using Sublime Text and CodeIgnitor to maintain and develop new modules for the web application.\r\nTrack bugs and issues on Bug Herder.\r\nKeep on track with Trello to make sure I hit deadlines control workload.\r\nTest using all browser and mobile devices.", "start": "2014-01-01", "end": "2014-03-01", "still_there": false, "skills": [{"name": "CodeIgniter"}, {"name": "Elasticsearch"}, {"name": "Sourcetree"}, {"name": "Ubuntu"}]}, {"company": "Cullinan Holdings Limited", "position": "Python Programmer", "description": "**Django Python Developer**\n\n1. Monitored and maintained operational readiness of middleware applications.\n2. Worked independently to design, develop, and test code.\n3. Designed web-based assets for deployment on cloud computing platforms.\n4. Stayed current on developments in related Python frameworks.\n5. Translated business requirements into logical and physical file structure designs.\n6. Developed Django Python for a small development team, focused on the tourist industry.\n\n\n**Streamlined error reporting using Loggly (Solar Winds) to alert when Django throws an error.**\n\nError Logging: Loggly-python-handler==1.0.1\n\nAnd integrated the OTP process into the login process using a custom backend.\n\n**Database**\n\nPostgres (psycopg2)\n\n**Using Django Tenants to develop software**\n\nDjango-tenants\n\nThis made the development a \"Software as a Service\" product.\n\nThis application enables Django-powered websites to have multiple tenants via PostgreSQL schemas. A vital feature for every Software-as-a-Service website.\n\n**Developed software for the following tenants:**\n\n[followme2africa](https://followme2africa.udms.cullinan.systems)\n[thompsonsafrica](https://thompsonsafrica.udms.cullinan.systems)\n[africandiamondtours](https://africandiamondtours.udms.cullinan.systems)\n[cullinanguidedjourneys](https://cullinanguidedjourneys.udms.cullinan.systems)\n[grosvenortours](https://grosvenortours.udms.cullinan.systems)\n[planetafricatours](https://planetafricatours.udms.cullinan.systems)\n[springbokatlas](https://springbokatlas.udms.cullinan.systems)\n[thompsonsholidays](https://thompsonsholidays.udms.cullinan.systems)\n[cullinannamibia](https://cullinannamibia.udms.cullinan.systems)\n[africandiamondtours](https://africandiamondtours.udms.cullinan.systems)\n\n**Python 3.6**\n\n**Django Stack**\n\nDjango==2.2.1\nDjango-autocomplete-light==3.5.1\ndjango-ckeditor==6.0.0django-cors-headers==3.7.0\nDjango-crispy-forms==1.7.2\ndjangorestframework==3.10.3\n\n\nUsed Javascript all the time mainly (JQuery): validation for a variety of fields and situations.", "start": "2020-11-01", "end": "2023-04-01", "still_there": false, "skills": [{"name": "JavaScript"}, {"name": "jQuery"}, {"name": "Python"}, {"name": "Bootstrap"}, {"name": "Django"}, {"name": "Bash"}, {"name": "GitHub"}, {"name": "GitLab"}, {"name": "RESTful API Design"}, {"name": "PyCharm"}]}]}